MikroElektronika/core_packages/ARM/gcc_clang/def/hdsc/HC32F146KA/mcu.h
typedef struct
{
    union
    {
        __IO uint8_t MR;
        stc_msc_spi_mr_field_t MR_f;
    };
    union
    {
        __IO uint8_t CR;
        stc_msc_spi_cr_field_t CR_f;
    };
    uint8_t RESERVED2[2];
    union
    {
        __IO uint8_t ECR;
        stc_msc_spi_ecr_field_t ECR_f;
    };
    union
    {
        __IO uint8_t SR;
        stc_msc_spi_sr_field_t SR_f;
    };
    uint8_t RESERVED4[2];
    union
    {
        __IO uint16_t RXDR;
        __IO uint16_t TXDR;
    };
    uint8_t RESERVED6[2];
    union
    {
        __IO uint16_t BRS;
        stc_msc_spi_brs_field_t BRS_f;
    };
    uint8_t RESERVED7[14];
    union
    {
        __IO uint8_t CSTMG0;
        stc_msc_spi_cstmg0_field_t CSTMG0_f;
    };
    union
    {
        __IO uint8_t CSTMG1;
        stc_msc_spi_cstmg1_field_t CSTMG1_f;
    };
    uint8_t RESERVED9[2];
    union
    {
        __IO uint16_t CSTMG32;
        stc_msc_spi_cstmg32_field_t CSTMG32_f;
    };
    uint8_t RESERVED10[2];
    union
    {
        __IO uint16_t EACR;
        stc_msc_spi_eacr_field_t EACR_f;
    };
    uint8_t RESERVED11[2];
    union
    {
        __IO uint16_t TMR;
        stc_msc_spi_tmr_field_t TMR_f;
    };
    uint8_t RESERVED12[2];
    union
    {
        __IO uint16_t TMC;
        stc_msc_spi_tmc_field_t TMC_f;
    };
    uint8_t RESERVED13[2];
    union
    {
        __IO uint16_t CSCR;
        stc_msc_spi_cscr_field_t CSCR_f;
    };
    uint8_t RESERVED14[2];
    union
    {
        __IO uint8_t CSFR0;
        stc_msc_spi_csfr0_field_t CSFR0_f;
    };
    union
    {
        __IO uint8_t CSFR1;
        stc_msc_spi_csfr1_field_t CSFR1_f;
    };
    uint8_t RESERVED16[2];
    union
    {
        __IO uint8_t CSFR2;
        stc_msc_spi_csfr2_field_t CSFR2_f;
    };
    uint8_t RESERVED17[3];
    union
    {
        __IO uint8_t TDTCNT0;
        stc_msc_spi_tdtcnt0_field_t TDTCNT0_f;
    };
    union
    {
        __IO uint8_t TDTCNT1;
        stc_msc_spi_tdtcnt1_field_t TDTCNT1_f;
    };
    uint8_t RESERVED19[2];
    union
    {
        __IO uint8_t TDTCNT2;
        stc_msc_spi_tdtcnt2_field_t TDTCNT2_f;
    };
    union
    {
        __IO uint8_t TDTCNT3;
        stc_msc_spi_tdtcnt3_field_t TDTCNT3_f;
    };
}M0P_MSC_SPI_TypeDef;

typedef struct
{
    union
    {
        __IO uint8_t MR;
        stc_msc_uart_mr_field_t MR_f;
    };
    union
    {
        __IO uint8_t CR;
        stc_msc_uart_cr_field_t CR_f;
    };
    uint8_t RESERVED2[2];
    union
    {
        __IO uint8_t ECR;
        stc_msc_uart_ecr_field_t ECR_f;
    };
    union
    {
        __IO uint8_t SR;
        stc_msc_uart_sr_field_t SR_f;
    };
    uint8_t RESERVED4[2];
    union
    {
        __IO uint16_t RXDR;
        __IO uint16_t TXDR;
    };
    uint8_t RESERVED6[2];
    union
    {
        __IO uint16_t BRS;
        stc_msc_uart_brs_field_t BRS_f;
    };
    uint8_t RESERVED7[66];
    union
    {
        __IO uint16_t COMP;
        stc_msc_uart_comp_field_t COMP_f;
    };
}M0P_MSC_UART_TypeDef;

typedef struct
{
    union
    {
        __IO uint32_t ACSTR;
        stc_mtb_dwt_acstr_field_t ACSTR_f;
    };
    union
    {
        __IO uint32_t DCSTR;
        stc_mtb_dwt_dcstr_field_t DCSTR_f;
    };
    union
    {
        __IO uint32_t MDCSTR;
        stc_mtb_dwt_mdcstr_field_t MDCSTR_f;
    };
    uint8_t RESERVED3[4];
    union
    {
        __IO uint32_t ACSPR;
        stc_mtb_dwt_acspr_field_t ACSPR_f;
    };
    union
    {
        __IO uint32_t DCSPR;
        stc_mtb_dwt_dcspr_field_t DCSPR_f;
    };
    union
    {
        __IO uint32_t MDCSPR;
        stc_mtb_dwt_mdcspr_field_t MDCSPR_f;
    };
    uint8_t RESERVED6[4];
    union
    {
        __IO uint8_t FCT;
        stc_mtb_dwt_fct_field_t FCT_f;
    };
    uint8_t RESERVED7[4015];
    union
    {
        __IO uint32_t PID4;
        stc_mtb_dwt_pid4_field_t PID4_f;
    };
    union
    {
        __IO uint32_t PID5;
        stc_mtb_dwt_pid5_field_t PID5_f;
    };
    union
    {
        __IO uint32_t PID6;
        stc_mtb_dwt_pid6_field_t PID6_f;
    };
    union
    {
        __IO uint32_t PID7;
        stc_mtb_dwt_pid7_field_t PID7_f;
    };
    union
    {
        __IO uint32_t PID0;
        stc_mtb_dwt_pid0_field_t PID0_f;
    };
    union
    {
        __IO uint32_t PID1;
        stc_mtb_dwt_pid1_field_t PID1_f;
    };
    union
    {
        __IO uint32_t PID2;
        stc_mtb_dwt_pid2_field_t PID2_f;
    };
    union
    {
        __IO uint32_t PID3;
        stc_mtb_dwt_pid3_field_t PID3_f;
    };
    union
    {
        __IO uint32_t CID0;
        stc_mtb_dwt_cid0_field_t CID0_f;
    };
    union
    {
        __IO uint32_t CID1;
        stc_mtb_dwt_cid1_field_t CID1_f;
    };
    union
    {
        __IO uint32_t CID2;
        stc_mtb_dwt_cid2_field_t CID2_f;
    };
    union
    {
        __IO uint32_t CID3;
        stc_mtb_dwt_cid3_field_t CID3_f;
    };
}M0P_MTB_DWT_TypeDef;

typedef struct
{
    union
    {
        __IO uint8_t OPA_CTL;
        stc_opa_ctl_field_t OPA_CTL_f;
    };
}M0P_OPA_TypeDef;

typedef struct
{
    union
    {
        __IO uint32_t HICR_TRMKEY;
        stc_osc_ctl_hicr_trmkey_field_t HICR_TRMKEY_f;
    };
    union
    {
        __IO uint32_t HICR_FTRM;
        stc_osc_ctl_hicr_ftrm_field_t HICR_FTRM_f;
    };
    union
    {
        __IO uint32_t HICR_TTRM;
        stc_osc_ctl_hicr_ttrm_field_t HICR_TTRM_f;
    };
    uint8_t RESERVED3[4];
    union
    {
        __IO uint8_t HICR_FDIV;
        stc_osc_ctl_hicr_fdiv_field_t HICR_FDIV_f;
    };
    uint8_t RESERVED4[15];
    union
    {
        __IO uint32_t HSXT_PWRCTL;
        stc_osc_ctl_hsxt_pwrctl_field_t HSXT_PWRCTL_f;
    };
    uint8_t RESERVED5[12];
    union
    {
        __IO uint32_t LSXT_PWRCTL;
        stc_osc_ctl_lsxt_pwrctl_field_t LSXT_PWRCTL_f;
    };
}M0P_OSC_CTL_TypeDef;

typedef struct
{
    union
    {
        __IO uint8_t PARITY_CTL;
        stc_parity_ctl_field_t PARITY_CTL_f;
    };
    uint8_t RESERVED1[3];
    union
    {
        __IO uint32_t PARITY_ADDR;
        stc_parity_addr_field_t PARITY_ADDR_f;
    };
}M0P_PARITY_TypeDef;

typedef struct
{
    union
    {
        __IO uint32_t CLKEN0;
        stc_pcg_clken0_field_t CLKEN0_f;
    };
    union
    {
        __IO uint32_t RSTCTL0;
        stc_pcg_rstctl0_field_t RSTCTL0_f;
    };
    uint8_t RESERVED2[8];
    union
    {
        __IO uint32_t CLKEN1;
        stc_pcg_clken1_field_t CLKEN1_f;
    };
    union
    {
        __IO uint32_t RSTCTL1;
        stc_pcg_rstctl1_field_t RSTCTL1_f;
    };
    uint8_t RESERVED4[8];
    union
    {
        __IO uint32_t CLKEN2;
        stc_pcg_clken2_field_t CLKEN2_f;
    };
    union
    {
        __IO uint32_t RSTCTL2;
        stc_pcg_rstctl2_field_t RSTCTL2_f;
    };
}M0P_PCG_TypeDef;

typedef struct
{
    __IO uint32_t WDT_LD;
    __IO uint32_t WDT_VL;
    union
    {
        __IO uint8_t WDT_CTL;
        stc_swwdt_wdt_ctl_field_t WDT_CTL_f;
    };
    uint8_t RESERVED3[3];
    __IO uint32_t WDT_INTCLR;
    union
    {
        __IO uint8_t WDT_STA;
        stc_swwdt_wdt_sta_field_t WDT_STA_f;
    };
    uint8_t RESERVED5[7];
    union
    {
        __IO uint8_t WDT_MDC;
        stc_swwdt_wdt_mdc_field_t WDT_MDC_f;
    };
    uint8_t RESERVED6[3047];
    __IO uint32_t WDT_LCK;
}M0P_SWWDT_TypeDef;

typedef struct
{
    union
    {
        __IO uint32_t UIDR0;
        stc_uid_uidr0_field_t UIDR0_f;
    };
    union
    {
        __IO uint32_t UIDR1;
        stc_uid_uidr1_field_t UIDR1_f;
    };
    union
    {
        __IO uint32_t UIDR2;
        stc_uid_uidr2_field_t UIDR2_f;
    };
}M0P_UID_TypeDef;

typedef struct
{
    union
    {
        __IO uint8_t VC_CTL1;
        stc_vc_ctl1_field_t VC_CTL1_f;
    };
    uint8_t RESERVED1[3];
    union
    {
        __IO uint16_t VC_CTL2;
        stc_vc_ctl2_field_t VC_CTL2_f;
    };
    uint8_t RESERVED2[2];
    union
    {
        __IO uint8_t VC_CTL3;
        stc_vc_ctl3_field_t VC_CTL3_f;
    };
}M0P_VC_TypeDef;

typedef struct
{
    union
    {
        __IO uint32_t LVD1_SET;
        stc_wsunit_lvd1_set_field_t LVD1_SET_f;
    };
    union
    {
        __IO uint32_t LVD_INT_STR;
        stc_wsunit_lvd_int_str_field_t LVD_INT_STR_f;
    };
    union
    {
        __IO uint32_t LVD_CLR;
        stc_wsunit_lvd_clr_field_t LVD_CLR_f;
    };
    uint8_t RESERVED3[4];
    union
    {
        __IO uint32_t LVD2_SET;
        stc_wsunit_lvd2_set_field_t LVD2_SET_f;
    };
    uint8_t RESERVED4[1772];
    union
    {
        __IO uint8_t BUR01;
        stc_wsunit_bur01_field_t BUR01_f;
    };
    union
    {
        __IO uint8_t BUR02;
        stc_wsunit_bur02_field_t BUR02_f;
    };
    union
    {
        __IO uint8_t BUR03;
        stc_wsunit_bur03_field_t BUR03_f;
    };
    union
    {
        __IO uint8_t BUR04;
        stc_wsunit_bur04_field_t BUR04_f;
    };
    union
    {
        __IO uint8_t BUR05;
        stc_wsunit_bur05_field_t BUR05_f;
    };
    union
    {
        __IO uint8_t BUR06;
        stc_wsunit_bur06_field_t BUR06_f;
    };
    union
    {
        __IO uint8_t BUR07;
        stc_wsunit_bur07_field_t BUR07_f;
    };
    union
    {
        __IO uint8_t BUR08;
        stc_wsunit_bur08_field_t BUR08_f;
    };
    union
    {
        __IO uint8_t BUR09;
        stc_wsunit_bur09_field_t BUR09_f;
    };
    union
    {
        __IO uint8_t BUR10;
        stc_wsunit_bur10_field_t BUR10_f;
    };
    union
    {
        __IO uint8_t BUR11;
        stc_wsunit_bur11_field_t BUR11_f;
    };
    union
    {
        __IO uint8_t BUR12;
        stc_wsunit_bur12_field_t BUR12_f;
    };
    union
    {
        __IO uint8_t BUR13;
        stc_wsunit_bur13_field_t BUR13_f;
    };
    union
    {
        __IO uint8_t BUR14;
        stc_wsunit_bur14_field_t BUR14_f;
    };
    union
    {
        __IO uint8_t BUR15;
        stc_wsunit_bur15_field_t BUR15_f;
    };
    union
    {
        __IO uint8_t BUR16;
        stc_wsunit_bur16_field_t BUR16_f;
    };
}M0P_WSUNIT_TypeDef;



