MikroElektronika/core_packages/ARM/gcc_clang/def/hdsc/HC32F146KA/mcu.h
#define bM0P_IRQC_IRQ19PEND_DMA0INT                     *((volatile unsigned int*)(0x42620C10UL))
#define bM0P_IRQC_IRQ20PEND_MSC6INT                     *((volatile unsigned int*)(0x42620C80UL))
#define bM0P_IRQC_IRQ20PEND_DMA1INT                     *((volatile unsigned int*)(0x42620C90UL))
#define bM0P_IRQC_IRQ24PEND_MOSCI                       *((volatile unsigned int*)(0x42620E80UL))
#define bM0P_IRQC_IRQ24PEND_SOSCI                       *((volatile unsigned int*)(0x42620E84UL))
#define bM0P_IRQC_IRQ24PEND_MPLLI                       *((volatile unsigned int*)(0x42620E88UL))
#define bM0P_IRQC_IRQ24PEND_WCI                         *((volatile unsigned int*)(0x42620E90UL))
#define bM0P_IRQC_IRQ24PEND_MSWKUP                      *((volatile unsigned int*)(0x42620E98UL))
#define bM0P_IRQC_IRQ24PEND_RAMI                        *((volatile unsigned int*)(0x42620E9CUL))
#define bM0P_IRQC_IRQ25PEND_ADCI0                       *((volatile unsigned int*)(0x42620F00UL))
#define bM0P_IRQC_IRQ25PEND_ADCI1                       *((volatile unsigned int*)(0x42620F04UL))
#define bM0P_IRQC_IRQ25PEND_ADCI2                       *((volatile unsigned int*)(0x42620F08UL))
#define bM0P_IRQC_IRQ25PEND_ADCI3                       *((volatile unsigned int*)(0x42620F0CUL))
#define bM0P_IRQC_IRQ25PEND_ADCI4                       *((volatile unsigned int*)(0x42620F10UL))
#define bM0P_IRQC_IRQ26PEND_VCI                         *((volatile unsigned int*)(0x42620F94UL))
#define bM0P_IRQC_IRQ28PEND_TPI                         *((volatile unsigned int*)(0x42621080UL))
#define bM0P_IRQC_IRQ28PEND_TZI                         *((volatile unsigned int*)(0x4262108CUL))
#define bM0P_IRQC_IRQ30PEND_OCMPU0                      *((volatile unsigned int*)(0x42621180UL))
#define bM0P_IRQC_IRQ30PEND_OCMPU1                      *((volatile unsigned int*)(0x42621184UL))
#define bM0P_IRQC_IRQ30PEND_OCMPU2                      *((volatile unsigned int*)(0x42621188UL))
#define bM0P_IRQC_IRQ30PEND_OCMPU3                      *((volatile unsigned int*)(0x4262118CUL))
#define bM0P_IRQC_IRQ30PEND_OCMPU4                      *((volatile unsigned int*)(0x42621190UL))
#define bM0P_IRQC_IRQ30PEND_OCMPU5                      *((volatile unsigned int*)(0x42621194UL))
#define bM0P_IRQC_IRQ31PEND_CTI0IRQ                     *((volatile unsigned int*)(0x42621200UL))
#define bM0P_IRQC_IRQ31PEND_CTI1IRQ                     *((volatile unsigned int*)(0x42621204UL))
#define bM0P_IRQC_IRQ31PEND_CTI2IRQ                     *((volatile unsigned int*)(0x42621208UL))
#define bM0P_IRQC_IRQ31PEND_CTI3IRQ                     *((volatile unsigned int*)(0x4262120CUL))
#define bM0P_IRQC_IRQ31PEND_CTI4IRQ                     *((volatile unsigned int*)(0x42621210UL))
#define bM0P_IRQC_IRQ31PEND_CTI5IRQ                     *((volatile unsigned int*)(0x42621214UL))
#define bM0P_IRQC_IRQ31PEND_CTI6IRQ                     *((volatile unsigned int*)(0x42621218UL))
#define bM0P_IRQC_IRQ31PEND_CTI7IRQ                     *((volatile unsigned int*)(0x4262121CUL))
#define bM0P_IRQC_IRQ31PEND_FLASHI                      *((volatile unsigned int*)(0x4262126CUL))
#define bM0P_LCDC_LCDCR0_CLKSEL                         *((volatile unsigned int*)(0x42640000UL))
#define bM0P_LCDC_LCDCR0_LCD_FRAME0                     *((volatile unsigned int*)(0x42640004UL))
#define bM0P_LCDC_LCDCR0_LCD_FRAME1                     *((volatile unsigned int*)(0x42640008UL))
#define bM0P_LCDC_LCDCR0_BIAS0                          *((volatile unsigned int*)(0x4264000CUL))
#define bM0P_LCDC_LCDCR0_BIAS1                          *((volatile unsigned int*)(0x42640010UL))
#define bM0P_LCDC_LCDCR0_LCD_MODE0                      *((volatile unsigned int*)(0x42640014UL))
#define bM0P_LCDC_LCDCR0_LCD_MODE1                      *((volatile unsigned int*)(0x42640018UL))
#define bM0P_LCDC_LCDCR0_LCD_MODE2                      *((volatile unsigned int*)(0x4264001CUL))
#define bM0P_LCDC_LCDCR1_VLCD0                          *((volatile unsigned int*)(0x42640020UL))
#define bM0P_LCDC_LCDCR1_VLCD1                          *((volatile unsigned int*)(0x42640024UL))
#define bM0P_LCDC_LCDCR1_VLCD2                          *((volatile unsigned int*)(0x42640028UL))
#define bM0P_LCDC_LCDCR1_CT0                            *((volatile unsigned int*)(0x4264002CUL))
#define bM0P_LCDC_LCDCR1_CT1                            *((volatile unsigned int*)(0x42640030UL))
#define bM0P_LCDC_LCDCR1_CT2                            *((volatile unsigned int*)(0x42640034UL))
#define bM0P_LCDC_LCDCR1_CMOD                           *((volatile unsigned int*)(0x42640038UL))
#define bM0P_LCDC_LCDCR2_CP_FREQ0                       *((volatile unsigned int*)(0x42640040UL))
#define bM0P_LCDC_LCDCR2_CP_FREQ1                       *((volatile unsigned int*)(0x42640044UL))
#define bM0P_LCDC_LCDCR2_VSEL0                          *((volatile unsigned int*)(0x42640054UL))
#define bM0P_LCDC_LCDCR2_VSEL1                          *((volatile unsigned int*)(0x42640058UL))
#define bM0P_LCDC_LCDCR2_WSEL                           *((volatile unsigned int*)(0x4264005CUL))
#define bM0P_LCDC_LCDCR3_LCD_EN                         *((volatile unsigned int*)(0x42640060UL))
#define bM0P_LCDC_LCDCR3_LCD_BUF0                       *((volatile unsigned int*)(0x42640070UL))
#define bM0P_LCDC_LCDCR3_LCD_BUF1                       *((volatile unsigned int*)(0x42640074UL))
#define bM0P_LCDC_LCDDVC_VE0                            *((volatile unsigned int*)(0x42640080UL))
#define bM0P_LCDC_LCDDVC_VE1                            *((volatile unsigned int*)(0x42640084UL))
#define bM0P_LCDC_LCDDVC_VE2                            *((volatile unsigned int*)(0x42640088UL))
#define bM0P_LCDC_LCDDVC_VE3                            *((volatile unsigned int*)(0x4264008CUL))
#define bM0P_LCDC_LCDDVC_VE4                            *((volatile unsigned int*)(0x42640090UL))
#define bM0P_LCDC_LCDCE0_COME0                          *((volatile unsigned int*)(0x42640100UL))
#define bM0P_LCDC_LCDCE0_COME1                          *((volatile unsigned int*)(0x42640104UL))
#define bM0P_LCDC_LCDCE0_COME2                          *((volatile unsigned int*)(0x42640108UL))
#define bM0P_LCDC_LCDCE0_COME3                          *((volatile unsigned int*)(0x4264010CUL))
#define bM0P_LCDC_LCDCE0_COME4                          *((volatile unsigned int*)(0x42640110UL))
#define bM0P_LCDC_LCDCE0_COME5                          *((volatile unsigned int*)(0x42640114UL))
#define bM0P_LCDC_LCDCE0_COME6                          *((volatile unsigned int*)(0x42640118UL))
#define bM0P_LCDC_LCDCE0_COME7                          *((volatile unsigned int*)(0x4264011CUL))
#define bM0P_LCDC_LCDSE0_SEGE0                          *((volatile unsigned int*)(0x42640180UL))
#define bM0P_LCDC_LCDSE0_SEGE1                          *((volatile unsigned int*)(0x42640184UL))
#define bM0P_LCDC_LCDSE0_SEGE2                          *((volatile unsigned int*)(0x42640188UL))
#define bM0P_LCDC_LCDSE0_SEGE3                          *((volatile unsigned int*)(0x4264018CUL))
#define bM0P_LCDC_LCDSE0_SEGE4                          *((volatile unsigned int*)(0x42640190UL))
#define bM0P_LCDC_LCDSE0_SEGE5                          *((volatile unsigned int*)(0x42640194UL))
#define bM0P_LCDC_LCDSE0_SEGE6                          *((volatile unsigned int*)(0x42640198UL))
#define bM0P_LCDC_LCDSE0_SEGE7                          *((volatile unsigned int*)(0x4264019CUL))
#define bM0P_LCDC_LCDSE1_SEGE8                          *((volatile unsigned int*)(0x426401A0UL))
#define bM0P_LCDC_LCDSE1_SEGE9                          *((volatile unsigned int*)(0x426401A4UL))
#define bM0P_LCDC_LCDSE1_SEGE10                         *((volatile unsigned int*)(0x426401A8UL))
#define bM0P_LCDC_LCDSE1_SEGE11                         *((volatile unsigned int*)(0x426401ACUL))
#define bM0P_LCDC_LCDSE1_SEGE12                         *((volatile unsigned int*)(0x426401B0UL))
#define bM0P_LCDC_LCDSE1_SEGE13                         *((volatile unsigned int*)(0x426401B4UL))
#define bM0P_LCDC_LCDSE1_SEGE14                         *((volatile unsigned int*)(0x426401B8UL))
#define bM0P_LCDC_LCDSE1_SEGE15                         *((volatile unsigned int*)(0x426401BCUL))
#define bM0P_LCDC_LCDSE2_SEGE16                         *((volatile unsigned int*)(0x426401C0UL))
#define bM0P_LCDC_LCDSE2_SEGE17                         *((volatile unsigned int*)(0x426401C4UL))
#define bM0P_LCDC_LCDSE2_SEGE18                         *((volatile unsigned int*)(0x426401C8UL))
#define bM0P_LCDC_LCDSE2_SEGE19                         *((volatile unsigned int*)(0x426401CCUL))
#define bM0P_LCDC_LCDSE2_SEGE20                         *((volatile unsigned int*)(0x426401D0UL))
#define bM0P_LCDC_LCDSE2_SEGE21                         *((volatile unsigned int*)(0x426401D4UL))
#define bM0P_LCDC_LCDSE2_SEGE22                         *((volatile unsigned int*)(0x426401D8UL))
#define bM0P_LCDC_LCDSE2_SEGE23                         *((volatile unsigned int*)(0x426401DCUL))
#define bM0P_LCDC_LCDSE3_SEGE24                         *((volatile unsigned int*)(0x426401E0UL))
#define bM0P_LCDC_LCDSE3_SEGE25                         *((volatile unsigned int*)(0x426401E4UL))
#define bM0P_LCDC_LCDSE3_SEGE26                         *((volatile unsigned int*)(0x426401E8UL))
#define bM0P_LCDC_LCDSE3_SEGE27                         *((volatile unsigned int*)(0x426401ECUL))
#define bM0P_LCDC_LCDSE3_SEGE28                         *((volatile unsigned int*)(0x426401F0UL))
#define bM0P_LCDC_LCDSE3_SEGE29                         *((volatile unsigned int*)(0x426401F4UL))
#define bM0P_LCDC_LCDSE3_SEGE30                         *((volatile unsigned int*)(0x426401F8UL))
#define bM0P_LCDC_LCDSE3_SEGE31                         *((volatile unsigned int*)(0x426401FCUL))
#define bM0P_LCDC_LCDSE4_SEGE32                         *((volatile unsigned int*)(0x42640200UL))
#define bM0P_LCDC_LCDSE4_SEGE33                         *((volatile unsigned int*)(0x42640204UL))
#define bM0P_LCDC_LCDSE4_SEGE34                         *((volatile unsigned int*)(0x42640208UL))
#define bM0P_LCDC_LCDSE4_SEGE35                         *((volatile unsigned int*)(0x4264020CUL))
#define bM0P_LCDC_LCDSE4_SEGE36                         *((volatile unsigned int*)(0x42640210UL))
#define bM0P_LCDC_LCDSE4_SEGE37                         *((volatile unsigned int*)(0x42640214UL))
#define bM0P_LCDC_LCDSE4_SEGE38                         *((volatile unsigned int*)(0x42640218UL))
#define bM0P_LCDC_LCDSE4_SEGE39                         *((volatile unsigned int*)(0x4264021CUL))
#define bM0P_MSC4_I2C_MR_TXIE                           *((volatile unsigned int*)(0x426E0008UL))
#define bM0P_MSC4_I2C_MR_RXIE                           *((volatile unsigned int*)(0x426E000CUL))
#define bM0P_MSC4_I2C_MR_MODE0                          *((volatile unsigned int*)(0x426E0014UL))
#define bM0P_MSC4_I2C_MR_MODE1                          *((volatile unsigned int*)(0x426E0018UL))
#define bM0P_MSC4_I2C_MR_MODE2                          *((volatile unsigned int*)(0x426E001CUL))
#define bM0P_MSC4_I2C_BC_INTF                           *((volatile unsigned int*)(0x426E0020UL))
#define bM0P_MSC4_I2C_BC_BERF                           *((volatile unsigned int*)(0x426E0024UL))
#define bM0P_MSC4_I2C_BC_INTE                           *((volatile unsigned int*)(0x426E0028UL))
#define bM0P_MSC4_I2C_BC_CNDDIE                         *((volatile unsigned int*)(0x426E002CUL))
#define bM0P_MSC4_I2C_BC_WTSEL                          *((volatile unsigned int*)(0x426E0030UL))
#define bM0P_MSC4_I2C_BC_ACKE                           *((volatile unsigned int*)(0x426E0034UL))
#define bM0P_MSC4_I2C_BC_OFITS                          *((volatile unsigned int*)(0x426E0038UL))
#define bM0P_MSC4_I2C_BC_MSS                            *((volatile unsigned int*)(0x426E003CUL))
#define bM0P_MSC4_I2C_BS_BSS                            *((volatile unsigned int*)(0x426E0080UL))
#define bM0P_MSC4_I2C_BS_STPCC                          *((volatile unsigned int*)(0x426E0084UL))
#define bM0P_MSC4_I2C_BS_ITSCC                          *((volatile unsigned int*)(0x426E0088UL))
#define bM0P_MSC4_I2C_BS_ABL                            *((volatile unsigned int*)(0x426E008CUL))
#define bM0P_MSC4_I2C_BS_TRX                            *((volatile unsigned int*)(0x426E0090UL))
#define bM0P_MSC4_I2C_BS_RAD                            *((volatile unsigned int*)(0x426E0094UL))
#define bM0P_MSC4_I2C_BS_ACKF                           *((volatile unsigned int*)(0x426E0098UL))
#define bM0P_MSC4_I2C_BS_FBB                            *((volatile unsigned int*)(0x426E009CUL))
#define bM0P_MSC4_I2C_SR_TBIF                           *((volatile unsigned int*)(0x426E00A0UL))
#define bM0P_MSC4_I2C_SR_TDEF                           *((volatile unsigned int*)(0x426E00A4UL))
#define bM0P_MSC4_I2C_SR_RDFF                           *((volatile unsigned int*)(0x426E00A8UL))
#define bM0P_MSC4_I2C_SR_ORF                            *((volatile unsigned int*)(0x426E00ACUL))
#define bM0P_MSC4_I2C_SR_TBIIE                          *((volatile unsigned int*)(0x426E00B0UL))
#define bM0P_MSC4_I2C_SR_DMAE                           *((volatile unsigned int*)(0x426E00B4UL))
#define bM0P_MSC4_I2C_SR_TEFS                           *((volatile unsigned int*)(0x426E00B8UL))
#define bM0P_MSC4_I2C_SR_RECLR                          *((volatile unsigned int*)(0x426E00BCUL))
#define bM0P_MSC4_I2C_BRS_BRS0                          *((volatile unsigned int*)(0x426E0180UL))
#define bM0P_MSC4_I2C_BRS_BRS1                          *((volatile unsigned int*)(0x426E0184UL))
#define bM0P_MSC4_I2C_BRS_BRS2                          *((volatile unsigned int*)(0x426E0188UL))
#define bM0P_MSC4_I2C_BRS_BRS3                          *((volatile unsigned int*)(0x426E018CUL))
#define bM0P_MSC4_I2C_BRS_BRS4                          *((volatile unsigned int*)(0x426E0190UL))
#define bM0P_MSC4_I2C_BRS_BRS5                          *((volatile unsigned int*)(0x426E0194UL))
#define bM0P_MSC4_I2C_BRS_BRS6                          *((volatile unsigned int*)(0x426E0198UL))
#define bM0P_MSC4_I2C_BRS_BRS7                          *((volatile unsigned int*)(0x426E019CUL))
#define bM0P_MSC4_I2C_BRS_BRS8                          *((volatile unsigned int*)(0x426E01A0UL))
#define bM0P_MSC4_I2C_BRS_BRS9                          *((volatile unsigned int*)(0x426E01A4UL))
#define bM0P_MSC4_I2C_BRS_BRS10                         *((volatile unsigned int*)(0x426E01A8UL))
#define bM0P_MSC4_I2C_BRS_BRS11                         *((volatile unsigned int*)(0x426E01ACUL))
#define bM0P_MSC4_I2C_BRS_BRS12                         *((volatile unsigned int*)(0x426E01B0UL))
#define bM0P_MSC4_I2C_BRS_BRS13                         *((volatile unsigned int*)(0x426E01B4UL))
#define bM0P_MSC4_I2C_BRS_BRS14                         *((volatile unsigned int*)(0x426E01B8UL))
#define bM0P_MSC4_I2C_SA_ADDR0                          *((volatile unsigned int*)(0x426E0200UL))
#define bM0P_MSC4_I2C_SA_ADDR1                          *((volatile unsigned int*)(0x426E0204UL))
#define bM0P_MSC4_I2C_SA_ADDR2                          *((volatile unsigned int*)(0x426E0208UL))
#define bM0P_MSC4_I2C_SA_ADDR3                          *((volatile unsigned int*)(0x426E020CUL))
#define bM0P_MSC4_I2C_SA_ADDR4                          *((volatile unsigned int*)(0x426E0210UL))
#define bM0P_MSC4_I2C_SA_ADDR5                          *((volatile unsigned int*)(0x426E0214UL))
#define bM0P_MSC4_I2C_SA_ADDR6                          *((volatile unsigned int*)(0x426E0218UL))
#define bM0P_MSC4_I2C_SA_AE                             *((volatile unsigned int*)(0x426E021CUL))
#define bM0P_MSC4_I2C_SAMSK_MSK0                        *((volatile unsigned int*)(0x426E0220UL))
#define bM0P_MSC4_I2C_SAMSK_MSK1                        *((volatile unsigned int*)(0x426E0224UL))
#define bM0P_MSC4_I2C_SAMSK_MSK2                        *((volatile unsigned int*)(0x426E0228UL))
#define bM0P_MSC4_I2C_SAMSK_MSK3                        *((volatile unsigned int*)(0x426E022CUL))
#define bM0P_MSC4_I2C_SAMSK_MSK4                        *((volatile unsigned int*)(0x426E0230UL))
#define bM0P_MSC4_I2C_SAMSK_MSK5                        *((volatile unsigned int*)(0x426E0234UL))
#define bM0P_MSC4_I2C_SAMSK_MSK6                        *((volatile unsigned int*)(0x426E0238UL))
#define bM0P_MSC4_I2C_SAMSK_EN                          *((volatile unsigned int*)(0x426E023CUL))
#define bM0P_MSC4_I2C_EBCR_BEC                          *((volatile unsigned int*)(0x426E03A0UL))
#define bM0P_MSC4_I2C_EBCR_DOE                          *((volatile unsigned int*)(0x426E03A4UL))
#define bM0P_MSC4_I2C_EBCR_SCLOC                        *((volatile unsigned int*)(0x426E03A8UL))
#define bM0P_MSC4_I2C_EBCR_SDAOC                        *((volatile unsigned int*)(0x426E03ACUL))
#define bM0P_MSC4_I2C_EBCR_SCLS                         *((volatile unsigned int*)(0x426E03B0UL))
#define bM0P_MSC4_I2C_EBCR_SDAS                         *((volatile unsigned int*)(0x426E03B4UL))
#define bM0P_MSC5_I2C_MR_TXIE                           *((volatile unsigned int*)(0x426E2008UL))
#define bM0P_MSC5_I2C_MR_RXIE                           *((volatile unsigned int*)(0x426E200CUL))
#define bM0P_MSC5_I2C_MR_MODE0                          *((volatile unsigned int*)(0x426E2014UL))
#define bM0P_MSC5_I2C_MR_MODE1                          *((volatile unsigned int*)(0x426E2018UL))
#define bM0P_MSC5_I2C_MR_MODE2                          *((volatile unsigned int*)(0x426E201CUL))
#define bM0P_MSC5_I2C_BC_INTF                           *((volatile unsigned int*)(0x426E2020UL))
#define bM0P_MSC5_I2C_BC_BERF                           *((volatile unsigned int*)(0x426E2024UL))
#define bM0P_MSC5_I2C_BC_INTE                           *((volatile unsigned int*)(0x426E2028UL))
#define bM0P_MSC5_I2C_BC_CNDDIE                         *((volatile unsigned int*)(0x426E202CUL))
#define bM0P_MSC5_I2C_BC_WTSEL                          *((volatile unsigned int*)(0x426E2030UL))
#define bM0P_MSC5_I2C_BC_ACKE                           *((volatile unsigned int*)(0x426E2034UL))
#define bM0P_MSC5_I2C_BC_OFITS                          *((volatile unsigned int*)(0x426E2038UL))
#define bM0P_MSC5_I2C_BC_MSS                            *((volatile unsigned int*)(0x426E203CUL))
#define bM0P_MSC5_I2C_BS_BSS                            *((volatile unsigned int*)(0x426E2080UL))
#define bM0P_MSC5_I2C_BS_STPCC                          *((volatile unsigned int*)(0x426E2084UL))
#define bM0P_MSC5_I2C_BS_ITSCC                          *((volatile unsigned int*)(0x426E2088UL))
#define bM0P_MSC5_I2C_BS_ABL                            *((volatile unsigned int*)(0x426E208CUL))
#define bM0P_MSC5_I2C_BS_TRX                            *((volatile unsigned int*)(0x426E2090UL))
#define bM0P_MSC5_I2C_BS_RAD                            *((volatile unsigned int*)(0x426E2094UL))
#define bM0P_MSC5_I2C_BS_ACKF                           *((volatile unsigned int*)(0x426E2098UL))
#define bM0P_MSC5_I2C_BS_FBB                            *((volatile unsigned int*)(0x426E209CUL))
#define bM0P_MSC5_I2C_SR_TBIF                           *((volatile unsigned int*)(0x426E20A0UL))
#define bM0P_MSC5_I2C_SR_TDEF                           *((volatile unsigned int*)(0x426E20A4UL))
#define bM0P_MSC5_I2C_SR_RDFF                           *((volatile unsigned int*)(0x426E20A8UL))
#define bM0P_MSC5_I2C_SR_ORF                            *((volatile unsigned int*)(0x426E20ACUL))
#define bM0P_MSC5_I2C_SR_TBIIE                          *((volatile unsigned int*)(0x426E20B0UL))
#define bM0P_MSC5_I2C_SR_DMAE                           *((volatile unsigned int*)(0x426E20B4UL))
#define bM0P_MSC5_I2C_SR_TEFS                           *((volatile unsigned int*)(0x426E20B8UL))
#define bM0P_MSC5_I2C_SR_RECLR                          *((volatile unsigned int*)(0x426E20BCUL))
#define bM0P_MSC5_I2C_BRS_BRS0                          *((volatile unsigned int*)(0x426E2180UL))
#define bM0P_MSC5_I2C_BRS_BRS1                          *((volatile unsigned int*)(0x426E2184UL))
#define bM0P_MSC5_I2C_BRS_BRS2                          *((volatile unsigned int*)(0x426E2188UL))
#define bM0P_MSC5_I2C_BRS_BRS3                          *((volatile unsigned int*)(0x426E218CUL))
#define bM0P_MSC5_I2C_BRS_BRS4                          *((volatile unsigned int*)(0x426E2190UL))
#define bM0P_MSC5_I2C_BRS_BRS5                          *((volatile unsigned int*)(0x426E2194UL))
#define bM0P_MSC5_I2C_BRS_BRS6                          *((volatile unsigned int*)(0x426E2198UL))
#define bM0P_MSC5_I2C_BRS_BRS7                          *((volatile unsigned int*)(0x426E219CUL))
#define bM0P_MSC5_I2C_BRS_BRS8                          *((volatile unsigned int*)(0x426E21A0UL))
#define bM0P_MSC5_I2C_BRS_BRS9                          *((volatile unsigned int*)(0x426E21A4UL))
#define bM0P_MSC5_I2C_BRS_BRS10                         *((volatile unsigned int*)(0x426E21A8UL))
#define bM0P_MSC5_I2C_BRS_BRS11                         *((volatile unsigned int*)(0x426E21ACUL))
#define bM0P_MSC5_I2C_BRS_BRS12                         *((volatile unsigned int*)(0x426E21B0UL))
#define bM0P_MSC5_I2C_BRS_BRS13                         *((volatile unsigned int*)(0x426E21B4UL))
#define bM0P_MSC5_I2C_BRS_BRS14                         *((volatile unsigned int*)(0x426E21B8UL))
#define bM0P_MSC5_I2C_SA_ADDR0                          *((volatile unsigned int*)(0x426E2200UL))
#define bM0P_MSC5_I2C_SA_ADDR1                          *((volatile unsigned int*)(0x426E2204UL))
#define bM0P_MSC5_I2C_SA_ADDR2                          *((volatile unsigned int*)(0x426E2208UL))
#define bM0P_MSC5_I2C_SA_ADDR3                          *((volatile unsigned int*)(0x426E220CUL))
#define bM0P_MSC5_I2C_SA_ADDR4                          *((volatile unsigned int*)(0x426E2210UL))
#define bM0P_MSC5_I2C_SA_ADDR5                          *((volatile unsigned int*)(0x426E2214UL))
#define bM0P_MSC5_I2C_SA_ADDR6                          *((volatile unsigned int*)(0x426E2218UL))
#define bM0P_MSC5_I2C_SA_AE                             *((volatile unsigned int*)(0x426E221CUL))
#define bM0P_MSC5_I2C_SAMSK_MSK0                        *((volatile unsigned int*)(0x426E2220UL))
#define bM0P_MSC5_I2C_SAMSK_MSK1                        *((volatile unsigned int*)(0x426E2224UL))
#define bM0P_MSC5_I2C_SAMSK_MSK2                        *((volatile unsigned int*)(0x426E2228UL))
#define bM0P_MSC5_I2C_SAMSK_MSK3                        *((volatile unsigned int*)(0x426E222CUL))
#define bM0P_MSC5_I2C_SAMSK_MSK4                        *((volatile unsigned int*)(0x426E2230UL))
#define bM0P_MSC5_I2C_SAMSK_MSK5                        *((volatile unsigned int*)(0x426E2234UL))
#define bM0P_MSC5_I2C_SAMSK_MSK6                        *((volatile unsigned int*)(0x426E2238UL))
#define bM0P_MSC5_I2C_SAMSK_EN                          *((volatile unsigned int*)(0x426E223CUL))
#define bM0P_MSC5_I2C_EBCR_BEC                          *((volatile unsigned int*)(0x426E23A0UL))
#define bM0P_MSC5_I2C_EBCR_DOE                          *((volatile unsigned int*)(0x426E23A4UL))
#define bM0P_MSC5_I2C_EBCR_SCLOC                        *((volatile unsigned int*)(0x426E23A8UL))
#define bM0P_MSC5_I2C_EBCR_SDAOC                        *((volatile unsigned int*)(0x426E23ACUL))
#define bM0P_MSC5_I2C_EBCR_SCLS                         *((volatile unsigned int*)(0x426E23B0UL))
#define bM0P_MSC5_I2C_EBCR_SDAS                         *((volatile unsigned int*)(0x426E23B4UL))
#define bM0P_MSC6_I2C_MR_TXIE                           *((volatile unsigned int*)(0x426E4008UL))
#define bM0P_MSC6_I2C_MR_RXIE                           *((volatile unsigned int*)(0x426E400CUL))
#define bM0P_MSC6_I2C_MR_MODE0                          *((volatile unsigned int*)(0x426E4014UL))
#define bM0P_MSC6_I2C_MR_MODE1                          *((volatile unsigned int*)(0x426E4018UL))
